# OOP
class Point :    # Поля, оголошені у класі, формально є 
    x = 0        # доступними (public) та статичними 
    y = 0        # (доступними через клас)



def main() :                 # створення об'єкту з класу здійснюється 
    p1 = Point()             # без оператора new
    print(p1.x, p1.y)        #    0 0
    Point.x = 10             # поле, оголошене у класі, доступне через ім'я класу
    print(p1.x, p1.y)        #    10 0  - зміна поля класу відбивається на об'єкті
    p2 = Point()             # створення другого об'єкту
    print(p2.x, p2.y)        #    10 0  - в ньому також проявляється статичне поле
    p1.x = 20                # очікування: зміна статичного поля
    print(p1.x, p2.x)        #    20 10 - реальність: утворення об'єктного поля
    # інструкція p1.x = 20 замість звернення до статичного поля класу
    # утворює об'єктне (локальне) поле з тим самим іменем (див. аналогію
    # 03_funcs.py line 11)
    del p1.x                 # видалення об'єктного поля
    print(p1.x, p2.x)        #    10 10 видалене поле замість None переводить до статичного
    Point.w = 30             # !! під час виконання змінюватись можуть не лише об'єкти, а й типи
    print(p1.w, p2.w)        #    30 30  зміна типу відбивається на усіх його об'єктах


if __name__ == '__main__' :
    main()
